package me.yokeyword.itemtouchhelperdemo.helper;

import java.util.Arrays;
import java.util.List;

/*******************************************************************
 *    * * * *   * * * *   *     *       Created by OCN.Yang
 *    *     *   *         * *   *       Time:2017/8/2 10:07.
 *    *     *   *         *   * *       Email address:ocnyang@gmail.com
 *    * * * *   * * * *   *     *.Yang  Web site:www.ocnyang.com
 *******************************************************************/

/**
 * Created by Panda on 19/4/28.
 */


public class DataManager {
    public static List<String> sStringList = Arrays.asList("推荐", "要闻", "新思想", "综合",
            "快闪", "发布", "实践", "订阅", "纪实", "经济", "人物", "科技", "文化", "党史", "人事", "国际", "十九大时间", "军事", "理论", "重力", "中立", "元歌",
            "司马懿", "吕布", "大夫", "医生", "白云", "下雨", "机器人", "好人", "坏人", "命运", "信誉", "飞机", "骆驼", "水杯", "悲剧", "手机", "姓名",
            "高级", "鼠标", "纸巾", "走路", "散步", "午餐", "吃饭", "衣服", "鞋子", "随便", "愤怒", "你好", "明天", "空调", "公车", "三元里", "雨伞",
            "编译器", "工作证", "哈哈", "固话", "手指", "指纹", "人脸识别", "故事", "股市", "熊市", "VIP", "圆珠笔");

    public static List<String> bottomString = Arrays.asList("用典", "时评", "思考", "法纪", "违法", "书记", "观察者模式", "适配器模式", "总书记", "造句", "发展", "进步", "高铁", "习大大",
            "中国", "互联网", "娱乐圈", "歌曲", "笑话", "黄色", "绿色", "紫色", "器材", "起色", "输入法", "腾讯", "阿里巴巴", "谷歌", "奥巴马", "百度",
            "360", "大润发", "停止", "缘分", "手稿", "高手", "操作", "瞎比比", "总理", "阴阳", "平衡", "蝎子", "写字", "墨子", "墨迹", "凶横", "蛮横",
            "混乱", "兽族", "人类", "虫族", "鞭子", "地毯", "飞碟", "太阳", "后羿", "瑶", "Kitty", "购物", "房间");
}
